Repository: oglops/pidgin-sendscreenshot
Catalog: trunk/po/*.po
Languages: ru

source: FTP upload failed:
ru: Ошибка загрузки на FTP:

source: as a link (_FTP upload)
ru: как ссылка (_FTP загрузка)

source: as a URL (_FTP upload)
ru: как URL (_FTP загрузка)

source: Error on line %d char %d:
ru: Ошибка на строке %d символ %d:

source: Something's missing for server '%s':
ru: Что-то пропущено в сервере '%s':

source: Please refer to %s to learn how to add your own server.
ru: Пожалуйста прочитайте %s чтобы узнать как добавить свой сервер.

source: Regular expression doesn't match !
ru: Регулярное выражение не совпадает !

source: Failed to upload the screenshot to '%s'!
ru: Ошибка загрузки скриншота на '%s'!

source: Your screenshot has been uploaded to '%s' but the link cannot be extracted : ***%s. Posible reasons are: - the server has been updated - cannot load the server response into memory - bad regular expression (if you are intending to add your own server)
ru: Скриншот был успешно загружен на '%s' но ссылка не была извлечена : ***%s. Возможные причины: - сервер был обновлен - невозможно загрузить ответ сервера в память - неверное регулярное выражение (в случае если вы добавляли свой сервер)

source: Incorrect xml host config file
ru: Ошибка в xml конфиг. файле

source: %s. This file contains a list of image hosting providers. Please connect to %s to in order to fetch it.
ru: %s. Данный файл содержит список сервисов для загрузки картинок. Соединитесь с %s чтобы загрузить его.

source: You haven't selected any image hosting provider yet. Please select one from the configure dialog.
ru: Вы еще не выбрали ни одного сервиса картинок. Пожалуйста выберите один из них в окне настроек.

source: Failed to parse the contents of: %s
ru: Невозможно пропарсить содержимое: %s

source: Selected host not met !
ru: Выбранный сервер не найден!

source: No server-side form handler !
ru: Не найден обработчик формы на сервере !

source: No file-select control name !
ru: Нет файла-выберите название !

source: No regular expression to extract html link !
ru: Отсутствует регулярное выражение для извлечения ссылки !

source: "%s" is not a valid element name!
ru: "%s" не является допустимым именем элемента!

source: "%s" is not a valid attribute for element "%s"!
ru: "%s" не является допустимым атрибутом для элемента "%s"!

source: element "%s" is missing an attribute !
ru: элемент "%s" не содержит атрибута !

source: a "value" attribute is missing !
ru: "значение" атрибута пропущено !

source: as a link (_HTML upload)
ru: как ссылка (_HTML загрузка)

source: as a URL (_HTML upload)
ru: как URL (_HTML загрузка)

source: More info
ru: Показать больше информации

source: Image
ru: Изображение

source: Image parameters
ru: Параметры изображения

source: Plugin behaviour
ru: Работа плагина

source: HTTP upload
ru: Загрузка по HTTP

source: FTP upload
ru: Загрузка по FTP

source: Image format:
ru: Формат изображения:

source: JPEG quality level:
ru: Качество JPEG:

source: PNG compression level:
ru: Уровень сжатия PNG:

source: Always add this signature:
ru: Всегда добавлять подпись:

source: Highlight mode:
ru: Режим подсветки:

source: lighten up desktop
ru: светлый экран

source: darken desktop
ru: темный экран

source: invert selection only
ru: инвертировать выбранный участок

source: borders only
ru: только границы

source: grayscale desktop
ru: серый экран

source: Folder to store captures in:
ru: Папка для сохранения скриншотов:

source: Always ask for filename when sending as a file.
ru: Всегда спрашивать имя файла при отправке в виде файла.

source: Show visual cues.
ru: Показывать визуальные подсказки.

source: Seconds to wait before desktop freezes:
ru: Сколько секунд ждать до заморозки экрана:

source: Pick an image hosting provider (<span foreground='blue'><u>list v.%s</u></span>)
ru: Выберите сайт для закачки (<span foreground='blue'><u>list v.%s</u></span>)

source: Connect timeout (sec):
ru: Таймаут соединения (сек.):

source: Upload timeout (sec):
ru: Таймаут загрузки (сек):

source: Remote FTP URL:
ru: Удаленный FTP сервер:

source: Corresponding Web address:
ru: Соответствующий сайт:

source: User:
ru: Логин:

source: Password:
ru: Пароль:

source: Send Screenshot
ru: Отправка скриншота

source: Capture and send a screenshot.
ru: Делает и отправлет скриншот.

source: This plugin will capture a screenshot given a rectangular area.
ru: Данный плагин делает скриншот выбранного участка экрана.

source: Error
ru: Ошибка

source: Location of your screenshot on disk:
ru: Расположение скриншота на диске:

source: Cannot allocate enough memory (%lu bytes) to load plugin data !
ru: Невозможно выделить достаточно памяти (%lu байт) для загрузки плагина!

source: Failed to allocate enough memory to create the screenshot. You will need to quit some applications and retry.
ru: Невозможно выделить память под создание скриншота. Закройте несколько программ и попробуйте снова.

source: Failed to save your screenshot to '%s'.
ru: Невозможно сохранить скриншот в '%s'.

source: Failed to get '%s' data.
ru: Невозможно получить '%s' данные.

source: Failed to insert your screenshot in the text area.
ru: Невозможно вставить скриншот в текстовое поле.

source: Another instance of %s is already running. Please wait before sending an other screenshot.
ru: Одна копия %s уже запущена. Пожалуйста подождите перед отправкой нового скриншота.

source: The image used to sign the screenshot is too big. %dx%d is the maximum allowed.
ru: Изображение для подписи скриншота слишком большое. %dx%d максимально разрешенный размер.

source: No selection
ru: Ничего не выбрано

source: Terms Of Service
ru: Правила сервиса

source: _Screenshot
ru: _Скриншот

source: Insert _Screenshot...
ru: Вставить _Скриншот...

source: Send a _Screenshot...
ru: Отправить _Скриншот...

source: capture
ru: скриншот

source: as an _Image
ru: как _Изображение

source: Set capture name
ru: Указать название скриншота

source: Capture name:
ru: Название скриншота

source: File already exists!
ru: Файл уже существует!

source: Uploading the screenshot to "%s"...
ru: Загружаю скриншот на "%s"...

source: Failed to insert a link because theconversation window is now closed. The link is: %s
ru: Невозможно вставить ссылку потому что окно чата было закрыто. Ссылка: %s
